# -*- coding:gbk -*-
import pandas as pd


# 创建一个包含问题答案的数据表
data = pd.DataFrame({
    '您的性别？':['男','女',0,0,0,0],
    '您的专业？':['文史类', '理工类','管理类','艺术类',0,0],
    '您所在的年级？':['大一','大二','大三','大四',0,0],
    '您的性格？': ['安静型', '外向型', '温顺型','坚定型','感性型','其他'],
    '您最常通过哪种方式上网？': ['在寝室用笔记本上网','用手机上网' , '用平板电脑上网','在网吧上','其他',0],
    '若有人工智能学习工具，影响您使用人工智能学习软件的原因是什么': ['信息杂乱','应用繁琐','资源收费','其他',0,0],
    '若您使用人工智能学习工具最不希望出现以下哪些事':['软件响应慢','所答问题不精炼','无效回答','其他',0,0],
})

# 进行独热编码
data_encoded = pd.get_dummies(data)
data_encoded.to_excel(r'C:\Users\Scott\Desktop\无序数据处理完.xlsx')
# 打印独热编码后的数据表
print(data_encoded)